Revit 2024 API
TriangulationInterfaceForTriangulatedShellComponent Members
The TriangulationInterfaceForTriangulatedShellComponent type exposes the following members.
Constructors
Name | Description
TriangulationInterfaceForTriangulatedShellComponent
 Constructs an interface object for a TriangulatedShellComponent.
Methods
Name | Description
Dispose |  (Inherited from TriangulationInterface.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from TriangulationInterface.)
See Also
TriangulationInterfaceForTriangulatedShellComponent Class
Autodesk.Revit.DB Namespace